# config
cask_args appdir: '/Applications'


# taps

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "cjbassi/ytop"
tap "artginzburg/tap"
tap "azure/kubelogin"
tap "ctrlspice/otel-desktop-viewer"
tap "derailed/popeye"
tap "ekvedaras/cask"
tap "equinix-labs/otel-cli"
tap "felixkratz/formulae"
tap "ggozad/formulas"
tap "grafana/grafana"
tap "kcl-lang/tap"
tap "kubewall/tap"
tap "powershell/tap"
tap "tabbyml/tabby"
tap "ynqa/tap"

# packages
brew "git"
brew "openjdk"
brew "coreutils"
brew "curl"
brew "cask"
brew "asdf"
brew "chezmoi"
brew "fish"
brew "gawk"
brew "gnu-sed"
brew "go"
brew "jq"
brew "make"
brew "neofetch"
brew "nmap"
brew "socat"
brew "ripgrep"
brew "starship"
brew "tldr"
brew "viddy"
brew "watch"
brew "yq"
brew "lsd"
brew "wget"
brew "fzf"
brew "cjbassi/ytop/ytop"
brew "helm"
brew "artginzburg/tap/sudo-touchid"
brew "act"
brew "age"
brew "asitop"
brew "btop"
brew "emacs"
brew "gcc"
brew "numpy"
brew "pipx"
brew "popeye"
brew "protobuf"
brew "python@3.11"
brew "python@3.12"
brew "terraform", link: false
brew "tfenv"
brew "tree"
brew "zoxide"
brew "aquasecurity/trivy/trivy"
brew "ctrlspice/otel-desktop-viewer/otel-desktop-viewer"
brew "equinix-labs/otel-cli/otel-cli"
brew "grafana/grafana/alloy"
brew "johanhaleby/kubetail/kubetail"
brew "kcl-lang/tap/kcl-lsp"
brew "kubewall/tap/kubewall"
brew "powershell/tap/powershell"
brew "robusta-dev/krr/krr"
brew "tabbyml/tabby/tabby"
brew "ynqa/tap/logu"

# casks
cask "rectangle"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "obsidian"
cask "vlc"
cask "visual-studio-code"
cask "firefox"
cask "iterm2"
cask "maccy"
cask "scroll-reverser"
cask "slack"
cask "orbstack"
cask "appcleaner"
cask "arc"
cask "betterdisplay"
cask "bruno"
cask "chromium"
cask "discord"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "gitbutler"
cask "hot"
cask "jet-pilot"
cask "jordanbaird-ice"
cask "librewolf"
cask "nyancat"
cask "tailscale"
cask "temurin@21"
cask "tomatobar"
cask "wireshark"
cask "zed"


# vscode
vscode "actionforge.actionforge"
vscode "adamhartford.vscode-base64"
vscode "alfnielsen.vsc-rename-files"
vscode "atommaterial.a-file-icon-vscode"
vscode "bennycode.sort-everything"
vscode "casualjim.gotemplate"
vscode "christian-kohler.path-intellisense"
vscode "coolbear.systemd-unit-file"
vscode "daltonmenezes.aura-theme"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "grafana.grafana-alloy"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hilleer.yaml-plus-json"
vscode "igorsbitnev.error-gutters"
vscode "janisdd.vscode-edit-csv"
vscode "jheilingbrunner.vscode-gnupg-tool"
vscode "jvalecillos.gpg"
vscode "k6.k6"
vscode "mcagampan.dark-horizon"
vscode "mdickin.markdown-shortcuts"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "michelemelluso.gitignore"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-aks-tools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "run-at-scale.terraform-doc-snippets"
vscode "ryu1kn.partial-diff"
vscode "samuelcolvin.jinjahtml"
vscode "sgryjp.vscode-stable-sort"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tim-koehler.helm-intellisense"
vscode "timonwong.shellcheck"
vscode "upboundio.upbound"
vscode "vscode-icons-team.vscode-icons"
vscode "weaveworks.vscode-gitops-tools"
vscode "yuvraj.json-scape-unscape"
vscode "yy0931.save-as-root"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zamerick.vscode-caddyfile-syntax"



{{- if eq .location "work" }}
# taps
tap "aquasecurity/trivy"
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "robusta-dev/krr"

# packages
brew "pre-commit"
brew "awscli"
brew "azure-cli"
brew "argocd"
brew "checkov"
brew "cilium-cli"
brew "dive"
brew "dog"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "kubectx"
brew "kubie"
brew "mimirtool"
brew "vault"
brew "aquasecurity/trivy/trivy"
brew "fluxcd/tap/flux"
brew "Azure/kubelogin/kubelogin"


# casks
cask "apache-directory-studio"
cask "keepassxc"
cask "meld"
cask "postman"
cask "headlamp"
cask "docker"

{{- end }}

# Install these on only on home
{{- if eq .location "home" }}
# packages
# casks
cask "steam"
{{- end }}

